In [1]:
import pandas as pd

In [2]:
df_exam = pd.read_csv("StudentsPerformance.csv")

In [3]:
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Selecting One Column

In [4]:
df_exam['lunch']

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

In [5]:
type(df_exam['lunch'])

pandas.core.series.Series

In [6]:
df_exam['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [7]:
df_exam['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [8]:
df_exam.lunch

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

In [10]:
df_exam.math score
# In pandas, when a column name contains spaces or special characters, you can't use the dot notation (df.column_name). Instead, you need to use bracket notation.

SyntaxError: invalid syntax (2905203442.py, line 1)

In [11]:
df_exam['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

# Selecting two or more columns

In [13]:
df_exam[['gender','lunch']]

     gender         lunch
0    female      standard
1    female      standard
2    female      standard
3      male  free/reduced
4      male      standard
..      ...           ...
995  female      standard
996    male  free/reduced
997  female  free/reduced
998  female      standard
999  female  free/reduced

[1000 rows x 2 columns]

In [14]:
type(df_exam[['gender','math score','reading score']])

pandas.core.frame.DataFrame

In [16]:
df_exam[['gender','math score','reading score','writing score']]

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]